src/Documents/PayrollCalculation.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Document>
		<Properties>
			<Name>PayrollCalculation</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Inventory</xr:Item>
				<xr:Item>AccumulationRegister.PaymentDeductionKinds</xr:Item>
				<xr:Item>AccumulationRegister.HumanResourcesAccounting</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AccountingPeriod</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>PaymentsDeductions</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Employee</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Employees</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Position</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Positions</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PaymentDeductionKind</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.PaymentDeductionKinds</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>StartDate</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EndDate</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DaysWorked</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>HoursWorked</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Rate</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AccountOfExpenses</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CustomerOrder</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ManualCorrection</Name>
							<Comment>Manual adjustment</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Indicator1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CalculationParameters</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Indicator2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CalculationParameters</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Indicator3</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation3</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CalculationParameters</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Enums/PaymentDeductionTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>PaymentDeductionTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Payment</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Deduction</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/PayrollCalculation/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// COMMON PROCEDURES AND FUNCTIONS

// Calculates the document amount.
//
Function GetDocumentAmount() Export

	PaymentsTable = New ValueTable;
    Array = New Array;
	ReturnStructure = New Structure("AmountAccrued, AmountWithheld, DocumentAmount", 0, 0, 0);
	
	Array.Add(Type("CatalogRef.PaymentDeductionKinds"));
	TypeDescription = New TypeDescription(Array, ,);
	Array.Clear();
	PaymentsTable.Columns.Add("PaymentDeductionKind", TypeDescription);

	Array.Add(Type("Number"));
	TypeDescription = New TypeDescription(Array, ,);
	Array.Clear();
	PaymentsTable.Columns.Add("Amount", TypeDescription);
	
	For each TSLine In PaymentsDeductions Do
		NewRow = PaymentsTable.Add();
        NewRow.PaymentDeductionKind = TSLine.PaymentDeductionKind;
        NewRow.Amount = TSLine.Amount;
	EndDo;
	
	Query = New Query("SELECT
	                      |	TablePaymentsDeductions.PaymentDeductionKind,
	                      |	TablePaymentsDeductions.Amount
	                      |INTO TablePaymentsDeductions
	                      |FROM
	                      |	&TablePaymentsDeductions AS TablePaymentsDeductions
	                      |;
	                      |
	                      |
	                      |SELECT
	                      |	SUM(CASE
	                      |			WHEN PayrollPaymentsDeductions.PaymentDeductionKind.Type = VALUE(Enum.PaymentDeductionTypes.Payment)
	                      |				THEN PayrollPaymentsDeductions.Amount
	                      |			ELSE 0
	                      |		END) AS AmountAccrued,
	                      |	SUM(CASE
	                      |			WHEN PayrollPaymentsDeductions.PaymentDeductionKind.Type = VALUE(Enum.PaymentDeductionTypes.Payment)
	                      |				THEN 0
	                      |			ELSE PayrollPaymentsDeductions.Amount
	                      |		END) AS AmountWithheld,
	                      |	SUM(CASE
	                      |			WHEN PayrollPaymentsDeductions.PaymentDeductionKind.Type = VALUE(Enum.PaymentDeductionTypes.Payment)
	                      |				THEN PayrollPaymentsDeductions.Amount
	                      |			ELSE -1 * PayrollPaymentsDeductions.Amount
	                      |		END) AS DocumentAmount
	                      |FROM
	                      |	TablePaymentsDeductions AS PayrollPaymentsDeductions");
						  
	Query.SetParameter("TablePaymentsDeductions", PaymentsTable);
	QueryResult = Query.ExecuteBatch();
	
	If QueryResult[1].IsEmpty() Then
		Return ReturnStructure;	
	Else
		FillPropertyValues(ReturnStructure, QueryResult[1].Unload()[0]);
		Return ReturnStructure;	
	EndIf; 

EndFunction

////////////////////////////////////////////////////////////////////////////////
// EVENT HANDLERS

// BeforeWrite event handler.
//
Procedure BeforeWrite(Cancellation, WriteMode, PostingMode)
	
	If DataExchange.Load Then
		Return;
	EndIf;

	DocumentAmount = GetDocumentAmount().DocumentAmount;
	
EndProcedure

// Posting event handler.
//
Procedure Posting(Cancellation, PostingMode)
	
	// Initializing additional properties for posting the document
	_DemoPayrollAndHRServer.InitializeAdditionalPropertiesForPosting(Ref, AdditionalProperties);
	
	// Initializing the document data
	Documents.PayrollCalculation.DataInitializationDocument(Ref, AdditionalProperties);
	
	// Preparing the record sets
	_DemoPayrollAndHRServer.PrepareRecordSetsForRecording(ThisObject);
	
	// Accounting
	_DemoPayrollAndHRServer.ReflectPaymentDeductionKinds(AdditionalProperties, RegisterRecords, Cancellation);
	_DemoPayrollAndHRServer.ReflectHumanResourcesAccounting(AdditionalProperties, RegisterRecords, Cancellation);
	_DemoPayrollAndHRServer.ReflectInventory(AdditionalProperties, RegisterRecords, Cancellation);
	//_DemoPayrollAndHRServer.ReflectGeneralJournal(AdditionalProperties, RegisterRecords, Cancellation);

	// Writing the record sets.
	_DemoPayrollAndHRServer.WriteRecordSets(ThisObject);

	// Controlling
	Documents.PayrollCalculation.RunControl(Ref, AdditionalProperties, Cancellation);
	
	AdditionalProperties.ForPosting.StructureTemporaryTables.TempTablesManager.Close();
	
EndProcedure

// UndoPosting event handler.
//
Procedure UndoPosting(Cancellation)
	
	// Initializing additional properties for clearing the document posting
	_DemoPayrollAndHRServer.InitializeAdditionalPropertiesForPosting(Ref, AdditionalProperties);
	
	// Preparing the record sets
	_DemoPayrollAndHRServer.PrepareRecordSetsForRecording(ThisObject);
	
	// Writing the record sets
	_DemoPayrollAndHRServer.WriteRecordSets(ThisObject);
	
	// Controlling
	Documents.PayrollCalculation.RunControl(Ref, AdditionalProperties, Cancellation, True);
	
EndProcedure
